Integrations/soap/templates/save_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <soapenv:Header/>
   <soapenv:Body>
      <wss:save soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wss="http://www.adonix.com/WSS">
         <callContext xsi:type="wss:CAdxCallContext">
            <codeLang xsi:type="xsd:string">ENG</codeLang>
            <poolAlias xsi:type="xsd:string">APDEMO</poolAlias>
            <poolId xsi:type="xsd:string"></poolId>
            <requestConfig xsi:type="xsd:string"><![CDATA[adxwss.optreturn=JSON&adxwss.beautify=true]]></requestConfig>
         </callContext>
         <publicName xsi:type="xsd:string">YPRJBUDGET</publicName>
         <objectXml xsi:type="xsd:string">
            <![CDATA[{
               "PJM0_1": {
                  "SALFCY": "{site}",
                  "OPEDEFFCY": "{site}",
                  "PIMDESAXX": "{description}",
                  "PIMDESAX1": "{short_desc}"
               },
               "PJM1_1": {
                  "OPPCMP": "{customer}",
                  "OPPREP": "{sales_rep}"
               },
               "PJM1_2": {
                  "OPPTYP": "{category}"
               }
            }]]>
         </objectXml>
      </wss:save>
   </soapenv:Body>
</soapenv:Envelope>